// use transliterate_ferris::convert::convert_indic_to_indic;
use std::time::{Duration, Instant};
use transliterate_ferris::convert::convert_indic_to_intermediate;
use transliterate_ferris::data::HASH_MAP;
use transliterate_ferris::data::SCRIPT_INTERMEDIATE;
use transliterate_ferris::read_mappings::Script;

fn main() {
    let mut start = Instant::now();

    let foo = &HASH_MAP;

    let telugu: &Script = foo.get("telugu").unwrap();
    let devanagari: &Script = foo.get("devanagari").unwrap();
    // println!("{:?}", SCRIPT_INTERMEDIATE);

    let input = "అస్త్య్ ఉత్తరస్యాం దిశి దేవతాత్మా హిమాలయో నామ నగాధిరాజః ।
    పూర్వాపరౌ తోయనిధీ విగాహ్య స్థితః పృథివ్యా ఇవ మానదణ్డః ॥
    యం సర్వశైలాః పరికల్ప్య వత్సం మేరౌ స్థితే దోగ్ధరి దోహదక్షే ।
    భాస్వన్తి రత్నాని మహౌషధీశ్ చ పృథూపదిష్టాం దుదుహుర్ ధరిత్రీమ్ ॥
    అనన్తరత్నప్రభవస్య యస్య హిమం న సౌభాగ్యవిలోపి జాతమ్ ।
    ఏకో హి దోషో గుణసంనిపాతే నిమజ్జతీన్దోః కిరణేష్వ్ ఇవాఙ్కః ॥
    యశ్ చాప్సరోవిభ్రమమణ్డనానాం సంపాదయిత్రీం శిఖరైర్ బిభర్తి ।
    బలాహకచ్ఛేదవిభక్తరాగామ్ అకాలసంధ్యామ్ ఇవ ధాతుమత్తామ్ ॥
    ఆమేఖలం సంచరతాం ఘనానాం చ్ఛాయామ్ అధఃసానుగతాం నిషేవ్య ।
    ఉద్వేజితా వృష్టిభిర్ ఆశ్రయన్తే శృఙ్గాణి యస్యాతపవన్తి సిద్ధాః ॥
    పదం తుషారస్రుతిధౌతరక్తం యస్మిన్న్ అదృష్ట్వాపి హతద్విపానామ్ ।
    విదన్తి మార్గం నఖరన్ధ్రముక్తైర్ ముక్తాఫలైః కేసరిణాం కిరాతాః ॥
    న్యస్తాక్షరా ధాతురసేన యత్ర భూర్జత్వచః కుఞ్జరబిన్దుశోణాః ।
    వ్రజన్తి విద్యాధరసున్దరీణామ్ అనఙ్గలేఖక్రియయోపయోగమ్ ॥
    యః పూరయన్ కీచకరన్ధ్రభాగాన్ దరీముఖోత్థేన సమీరణేన ।
    ఉద్గాస్యతామ్ ఇచ్ఛతి కింనరాణాం తానప్రదాయిత్వమ్ ఇవోపగన్తుమ్ ॥
    కపోలకణ్డూః కరిభిర్ వినేతుం విఘట్టితానాం సరలద్రుమాణామ్ ।
    యత్ర స్రుతక్షీరతయా ప్రసూతః సానూని గన్ధః సురభీకరోతి ॥
    వనేచరాణాం వనితాసఖానాం దరీగృహోత్సఙ్గనిషక్తభాసః ।
    భవన్తి యత్రౌషధయో రజన్యామ్ అతైలపూరాః సురతప్రదీపాః ॥
    ఉద్వేజయత్య్ అఙ్గులిపార్ష్ణిభాగాన్ మార్గే శిలీభూతహిమే ఽపి యత్ర ।
    న దుర్వహశ్రోణిపయోధరార్తా భిన్దన్తి మన్దాం గతిమ్ అశ్వముఖ్యః ॥
    దివాకరాద్ రక్షతి యో గుహాసు లీనం దివా భీతమ్ ఇవాన్ధకారమ్ ।
    క్షుద్రే ఽపి నూనం శరణం ప్రపన్నే మమత్వమ్ ఉచ్చైఃశిరసాం సతీవ ॥
    లాఙ్గూలవిక్షేపవిసర్పిశోభైర్ ఇతస్ తతశ్ చన్ద్రమరీచిగౌరైః ।
    యస్యార్థయుక్తం గిరిరాజశబ్దం కుర్వన్తి వాలవ్యజనైశ్ చమర్యః ॥
    యత్రాంశుకాక్షేపవిలజ్జితానాం యదృచ్ఛయా కింపురుషాఙ్గనానామ్ ।
    దరీగృహద్వారవిలమ్బిబిమ్బాస్ తిరస్కరిణ్యో జలదా భవన్తి ॥
    భాగీరథీనిర్ఝరసీకరాణాం వోఢా ముహుః కమ్పితదేవదారుః ।
    యద్ వాయుర్ అన్విష్టమృగైః కిరాతైర్ ఆసేవ్యతే భిన్నశిఖణ్డిబర్హః ॥
    సప్తర్షిహస్తావచితావశేషాణ్య్ అధో వివస్వాన్ పరివర్తమానః ।
    పద్మాని యస్యాగ్రసరోరుహాణి ప్రబోధయత్య్ ఊర్ధ్వముఖైర్ మయూఖైః ॥
    యజ్ఞాఙ్గయోనిత్వమ్ అవేక్ష్య యస్య సారం ధరిత్రీధరణక్షమం చ ।
    ప్రజాపతిః కల్పితయజ్ఞభాగం శైలాధిపత్యం స్వయమ్ అన్వతిష్ఠత్ ॥
    స మానసీం మేరుసఖః పితౄణాం కన్యాం కులస్య స్థితయే స్థితిజ్ఞః ।
    మేనాం మునీనామ్ అపి మాననీయామ్ ఆత్మానురూపాం విధినోపయేమే ॥
    కాలక్రమేణాథ తయోః ప్రవృత్తే స్వరూపయోగ్యే సురతప్రసఙ్గే ।
    మనోరమం యౌవనమ్ ఉద్వహన్త్యా గర్భో ఽభవద్ భూధరరాజపత్న్యాః ॥
    అసూత సా నాగవధూపభోగ్యం మైనాకమ్ అమ్భోనిధిబద్ధసఖ్యమ్ ।
    క్రుద్ధే ఽపి పక్షచ్ఛిది వృత్రశత్రావ్ అవేదనాజ్ఞం కులిశక్షతానామ్ ॥
    అథావమానేన పితుః ప్రయుక్తా దక్షస్య కన్యా భవపూర్వపత్నీ ।
    సతీ సతీ యోగవిసృష్టదేహా తాం జన్మనే శైలవధూం ప్రపేదే ॥
    సా భూధరాణామ్ అధిపేన తస్యాం సమాధిమత్యామ్ ఉదపాది భవ్యా ।
    సమ్యక్ప్రయోగాద్ అపరిక్షతాయాం నీతావ్ ఇవోత్సాహగుణేన సంపత్ ॥
    ప్రసన్నదిక్ పాంసువివిక్తవాతం శఙ్ఖస్వనానన్తరపుష్పవృష్టి ।
    శరీరిణాం స్థావరజఙ్గమానాం సుఖాయ తజ్జన్మదినం బభూవ ॥
    తయా దుహిత్రా సుతరాం సవిత్రీ స్ఫురత్ప్రభామణ్డలయా చకాసే ।
    విదూరభూమిర్ నవమేఘశబ్దాద్ ఉద్భిన్నయా రత్నశలాకయేవ ॥
    దినే దినే సా పరివర్ధమానా లబ్ధోదయా చాన్ద్రమసీవ లేఖా ।
    పుపోష లావణ్యమయాన్ విశేషాఞ్ జ్యోత్స్నాన్తరాణీవ కలాన్తరాణి ॥
    తాం పార్వతీత్య్ ఆభిజనేన నామ్నా బన్ధుప్రియాం బన్ధుజనో జుహావ ।
    ఉ మేతి మాత్రా తపసో నిషిద్ధా పశ్చాద్ ఉమాఖ్యాం సుముఖీ జగామ ॥
    మహీభృతః పుత్రవతో ఽపి దృష్టిస్ తస్మిన్న్ అపత్యే న జగామ తృప్తిమ్ ।
    అనన్తపుష్పస్య మధోర్ హి చూతే ద్విరేఫమాలా సవిశేషసఙ్గా ॥
    ప్రభామహత్యా శిఖయేవ దీపస్ త్రిమార్గయేవ త్రిదివస్య మార్గః ।
    సంస్కారవత్యేవ గిరా మనీషీ తయా స పూతశ్ చ విభూషితశ్ చ ॥
    మన్దాకినీసైకతవేదికాభిః సా కన్దుకైః కృత్రిమపుత్రకైశ్ చ ।
    రేమే ముహుర్ మధ్యగతా సఖీనాం క్రీడారసం నిర్విశతీవ బాల్యే ॥
    తాం హంసమాలాః శరదీవ గఙ్గాం మహౌషధిం నక్తమ్ ఇవాత్మభాసః ।
    స్థిరోపదేశామ్ ఉపదేశకాలే ప్రపేదిరే ప్రాక్తనజన్మవిద్యాః ॥
    అసంభృతం మణ్డనమ్ అఙ్గయష్టేర్ అనాసవాఖ్యం కరణం మదస్య ।
    కామస్య పుష్పవ్యతిరిక్తమ్ అస్త్రం బాల్యాత్ పరం సాథ వయః ప్రపేదే ॥
    ఉన్మీలితం తూలికయేవ చిత్రం సూర్యాంశుభిర్ భిన్నమ్ ఇవారవిన్దమ్ ।
    బభూవ తస్యాశ్ చతురస్రశోభి వపుర్ విభక్తం నవయౌవనేన ॥
    అభ్యున్నతాఙ్గుష్ఠనఖప్రభాభిర్ నిక్షేపణాద్ రాగమ్ ఇవోద్గిరన్తౌ ।
    ఆజహ్రతుస్ తచ్చరణౌ పృథివ్యాం స్థలారవిన్దశ్రియమ్ అవ్యవస్థామ్ ॥
    సా రాజహంసైర్ ఇవ సంనతాఙ్గీ గతేషు లీలాఞ్చితవిక్రమేషు ।
    వ్యనీయత ప్రత్యుపదేశలుబ్ధైర్ ఆదిత్సుభిర్ నూపురసిఞ్జితాని ॥
    వృత్తానుపూర్వే చ న చాతిదీర్ఘే జఙ్ఘే శుభే సృష్టవతస్ తదీయే ।
    శేషాఙ్గనిర్మాణవిధౌ విధాతుర్ లావణ్య ఉత్పాద్య ఇవాస యత్నః ॥
    నాగేన్ద్రహస్తాస్ త్వచి కర్కశత్వాద్ ఏకాన్తశైత్యాత్ కదలీవిశేషాః ।
    లబ్ధ్వాపి లోకే పరిణాహి రూపం జాతాస్ తదూర్వోర్ ఉపమానబాహ్యాః ॥
    ఏతావతా నన్వ్ అనుమేయశోభం కాఞ్చీగుణస్థానమ్ అనిన్దితాయాః ।
    ఆరోపితం యద్ గిరిశేన పశ్చాద్ అనన్యనారీకమనీయమ్ అఙ్కమ్ ॥
    తస్యాః ప్రవిష్టా నతనాభిరన్ధ్రం రరాజ తన్వీ నవలోమరాజిః ।
    నీవీమ్ అతిక్రమ్య సితేతరస్య తన్మేఖలామధ్యమణేర్ ఇవార్చిః ॥
    మధ్యేన సా వేదివిలగ్నమధ్యా వలిత్రయం చారు బభార బాలా ।
    ఆరోహణార్థం నవయౌవనేన కామస్య సోపానమ్ ఇవ ప్రయుక్తమ్ ॥
    అన్యోన్యమ్ ఉత్పీడయద్ ఉత్పలాక్ష్యాః స్తనద్వయం పాణ్డు తథా ప్రవృద్ధమ్ ।
    మధ్యే యథా శ్యామముఖస్య తస్య మృణాలసూత్రాన్తరమ్ అప్య్ అలభ్యమ్ ॥
    శిరీషపుష్పాధికసౌకుమార్యౌ బాహూ తదీయావ్ ఇతి మే వితర్కః ।
    పరాజితేనాపి కృతౌ హరస్య యౌ కణ్ఠపాశౌ మకరధ్వజేన ॥
    కణ్ఠస్య తస్యాః స్తనబన్ధురస్య ముక్తాకలాపస్య చ నిస్తలస్య ।
    అన్యోన్యశోభాజననాద్ బభూవ సాధారణో భూషణభూష్యభావః ॥
    చన్ద్రం గతా పద్మగుణాన్ న భుఙ్క్తే పద్మాశ్రితా చాన్ద్రమసీమ్ అభిఖ్యామ్ ।
    ఉమాముఖం తు ప్రతిపద్య లోలా ద్విసంశ్రయాం ప్రీతిమ్ అవాప లక్ష్మీః ॥
    పుష్పం ప్రవాలోపహితం యది స్యాన్ ముక్తాఫలం వా స్ఫుటవిద్రుమస్థమ్ ।
    తతో ఽనుకుర్యాద్ విశదస్య తస్యాస్ తామ్రౌష్ఠపర్యస్తరుచః స్మితస్య ॥
    స్వరేణ తస్యామ్ అమృతస్రుతేవ ప్రజల్పితాయామ్ అభిజాతవాచి ।
    అప్య్ అన్యపుష్టా ప్రతికూలశబ్దా శ్రోతుర్ వితన్త్రీర్ ఇవ తాడ్యమానా ॥
    ప్రవాతనీలోత్పలనిర్విశేషమ్ అధీరవిప్రేక్షితమ్ ఆయతాక్ష్యా ।
    తయా గృహీతం ను మృగాఙ్గనాభ్యస్ తతో గృహీతం ను మృగాఙ్గనాభిః ॥
    తస్యాః శలాకాఞ్జననిర్మితేవ కాన్తిర్ భ్రువోర్ ఆనతలేఖయోర్ యా ।
    తాం వీక్ష్య లీలాచతురామ్ అనఙ్గః స్వచాపసౌన్దర్యమదం ముమోచ ॥
    లజ్జా తిరశ్చాం యది చేతసి స్యాద్ అసంశయం పర్వతరాజపుత్ర్యాః ।
    తం కేశపాశం ప్రసమీక్ష్య కుర్యుర్ వాలప్రియత్వం శిథిలం చమర్యః ॥
    సర్వోపమాద్రవ్యసముచ్చయేన యథాప్రదేశం వినివేశితేన ।
    సా నిర్మితా విశ్వసృజా ప్రయత్నాద్ ఏకస్థసౌన్దర్యదిదృక్షయేవ ॥
    తాం నారదః కామచరః కదా చిత్ కన్యాం కిల ప్రేక్ష్య పితుః సమీపే ।
    సమాదిదేశైకవధూం భవిత్రీం ప్రేమ్ణా శరీరార్ధహరాం హరస్య ॥
    గురుః ప్రగల్భే ఽపి వయస్య్ అతో ఽస్యాస్ తస్థౌ నివృత్తాన్యవరాభిలాషః ।
    ఋతే కృశానోర్ న హి మన్త్రపూతమ్ అర్హన్తి తేజాంస్య్ అపరాణి హవ్యమ్ ॥
    అయాచితారం న హి దేవదేవమ్ అద్రిః సుతాం గ్రాహయితుం శశాక ।
    అభ్యర్థనాభఙ్గభయేన సాధుర్ మాధ్యస్థ్యమ్ ఇష్టే ఽప్య్ అవలమ్బతే ఽర్థే ॥
    యదైవ పూర్వే జననే శరీరం సా దక్షరోషాత్ సుదతీ ససర్జ ।
    తదాప్రభృత్య్ ఏవ విముక్తసఙ్గః పతిః పశూనామ్ అపరిగ్రహో ఽభూత్ ॥
    స కృత్తివాసాస్ తపసే యతాత్మా గఙ్గాప్రవాహోక్షితదేవదారు ।
    ప్రస్థం హిమాద్రేర్ మృగనాభిగన్ధి కిం చిత్ క్వణత్కింనరమ్ అధ్యువాస ॥
    గణా నమేరుప్రసవావతంసా భూర్జత్వచః స్పర్శవతీర్ దధానాః ।
    మనఃశిలావిచ్ఛురితా నిషేదుః శైలేయనద్ధేషు శిలాతలేషు ॥
    తుషారసంఘాతశిలాః ఖురాగ్రైః సముల్లిఖన్ దర్పకలః కకుద్మాన్ ।
    దృష్టః కథం చిద్ గవయైర్ వివిగ్నైర్ అసోఢసింహధ్వనిర్ ఉన్ననాద ॥
    తత్రాగ్నిమ్ ఆధాయ సమిత్సమిద్ధం స్వమ్ ఏవ మూర్త్యన్తరమ్ అష్టమూర్తిః ।
    స్వయం విధాతా తపసః ఫలానామ్ కేనాపి కామేన తపశ్ చచార ॥
    అనర్ఘ్యమ్ అర్ఘ్యేణ తమ్ అద్రినాథః స్వర్గౌకసామ్ అర్చితమ్ అర్చయిత్వా ।
    ఆరాధనాయాస్య సఖీసమేతాం సమాదిదేశ ప్రయతాం తనూజామ్ ॥
    ప్రత్యర్థిభూతామ్ అపి తాం సమాధేః శుశ్రూషమాణాం గిరిశో ఽనుమేనే ।
    వికారహేతౌ సతి విక్రియన్తే యేషాం న చేతాంసి త ఏవ ధీరాః ॥
    అవచితబలిపుష్పా వేదిసంమార్గదక్షా నియమవిధిజలానాం బర్హిషాం చోపనేత్రీ ।
    గిరిశమ్ ఉపచచార ప్రత్యహం సా సుకేశీ నియమితపరిఖేదా తచ్ఛిరశ్చన్ద్రపాదైః ॥";

    let initialization = start.elapsed();
    println!("initialization: {:?}", initialization);
    start = Instant::now();
    // println!("{:?}", convert_indic_to_indic(input, telugu, devanagari));
    let intermediate = convert_indic_to_intermediate(input, telugu);
    // println!("{:?}", intermediate);

    let conversion: Duration = start.elapsed();

    println!("conversion: {:?}", conversion);
}
